# MacroLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager..::..MacroLevel Property
MacroManager Class See Also
---
The Macro level.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroLevel MacroLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MacroLevel As MacroLevel
	Get
```

Visual C++
---
```text
public:
property MacroLevel MacroLevel {
	MacroLevel get ();
}
```

# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace